flix2/app/views/movies/_form.html.erb

      <li>
        <%= f.collection_check_boxes(:genre_ids, Genre.all.order(name: :asc), :id, :name) %>
---
SELECT "genres".* FROM "genres"   ORDER BY "genres"."name" ASC