flix2/app/views/movies/show.html.erb

  <h3>Reviews</h3>
  <p>See all <%= link_to pluralize(@movie.reviews.size, "Review"), movie_reviews_path(@movie) %></p>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 6]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 5]]