events2/app/controllers/events_controller.rb

  def set_event
    @event = Event.find_by!(slug: params[:id])
---
SELECT  "events".* FROM "events"  WHERE "events"."slug" = 'hackathon' LIMIT 1