events2/app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."event_id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."event_id" = ?  [["event_id", 1]]
---
  def show
    @event = Event.find(params[:id])
    @likers = @event.likers
    @likes = @event.likes
    @categories = @event.categories
    if current_user
      @current_like = current_user.likes.find_by(event_id: @event.id)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Updated Event Name"], ["starts_at", "2015-12-05 02:09:00.000000"], ["updated_at", "2015-11-25 02:09:22.798319"]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save