events2/app/controllers/likes_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-07 20:13:41.359424"], ["event_id", 1], ["updated_at", "2015-12-07 20:13:41.359424"], ["user_id", 1]]
---
  def create
    @event = Event.find(params[:event_id])
    @event.likes.create!(user: current_user)

SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT 1  [["user_id", 11], ["id", 8]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 8]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    like = current_user.likes.find(params[:id])
    like.destroy
    @event = Event.find(params[:event_id])