events2/app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "richardson.ae@gmail.com"], ["password_digest", "$2a$10$hGjJ3Do0zc1ke91A1VvxfOKCULw9aVwNjoNZWkvV3Dm54zP01JFhS"], ["updated_at", "2015-12-01 01:13:37.878677"]]
---
  def update
     #@user = User.find(params[:id])
     if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    #@user = User.find(params[:id])
    @user.destroy