crowdfund/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "projects"."id" = 3  [["description", "A description of a project involving bonfires and marshmallows. "], ["name", "Bonfire Project"], ["updated_at", "2015-11-13 23:11:19.393434"]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    if @project.save