crowdfund/app/views/pledges/index.html.erb

SELECT "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ?  ORDER BY created_at DESC  [["project_id", 11]]
SELECT COUNT(*) FROM "pledges"  WHERE "pledges"."project_id" = ?  [["project_id", 2]]
---
<h1 id="content-header"><%= pluralize(@project.pledges.size, "Pledge") %> for <%= link_to @project.name, @project %></h1>