flix2/app/views/genres/show.html.erb

SELECT "movies".* FROM "movies" INNER JOIN "genrefications" ON "movies"."id" = "genrefications"."movie_id" WHERE "genrefications"."genre_id" = ?  [["genre_id", 1]]
SELECT COUNT(*) FROM "movies" INNER JOIN "genrefications" ON "movies"."id" = "genrefications"."movie_id" WHERE "genrefications"."genre_id" = ?  [["genre_id", 7]]
---
  <header>
    <h1><%= @genre.name %>: <%= pluralize(@genre.movies.size, "Movie") %></h1>