crowdfund2/app/views/users/show.html.erb

SELECT  1 AS one FROM "pledges"  WHERE "pledges"."user_id" = ? LIMIT 1  [["user_id", 14]]
SELECT "pledges".* FROM "pledges"  WHERE "pledges"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 14]]
---

  <% if @user.pledges.any? %>