flix2/app/controllers/favorites_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-07 21:16:30.689222"], ["movie_id", 6], ["updated_at", "2015-12-07 21:16:30.689222"], ["user_id", 14]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @movie.favorites.create!(user: current_user)

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 14], ["id", 8]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 8]]
---
  def destroy
    @movie = Movie.find(params[:movie_id])
    favorite = current_user.favorites.find(params[:id])
    favorite.destroy

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:movie_id])