flix2/app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres"  WHERE "genres"."slug" = 'comedy' LIMIT 1
---
  def set_genre
    @genre = Genre.find_by!(slug: params[:id])