flix2/app/controllers/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"   ORDER BY name

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-12-08 20:23:04.085998"], ["name", "Chupper"], ["updated_at", "2015-12-08 20:23:04.085998"]]

  def destroy
    @genre = Genre.find(params[:id])
    @genre.destroy
---
SELECT  "genres".* FROM "genres"  WHERE "genres"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 13]]

  def set_genre
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres"  WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]