flix2/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    @reviews = @movie.reviews
    @fans = @movie.fans
    @genres = @movie.genres

    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 6 LIMIT 1  [["user_id", 14]]
SELECT "genres".* FROM "genres" INNER JOIN "genrefications" ON "genres"."id" = "genrefications"."genre_id" WHERE "genrefications"."movie_id" = ?  [["movie_id", 6]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 6]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "movies" SET "released_on" = ?, "updated_at" = ? WHERE "movies"."id" = 6  [["released_on", "2010-12-05"], ["updated_at", "2015-12-04 01:58:42.136280"]]