flix2/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["name", "Curly"], ["password_digest", "$2a$10$BgWrLnrTeW7uFeWTqGSfgeI/NwX7SaFgXkMmUe92PE8ABmQe/aQLC"], ["updated_at", "2015-11-30 05:09:16.487961"]]