crowdfund2/app/views/projects/_form.html.erb

SELECT "categories".* FROM "categories"   ORDER BY "categories"."name" ASC
---
      <li>
        <%= f.collection_check_boxes(:category_ids, Category.all.sort(:name), :id, :name) %>