crowdfund2/app/views/projects/index.html.erb

            <th>Followers</th>
            <td><%= pluralize(project.follows.size, "follower") %></td>
---
SELECT COUNT(*) FROM "follows"  WHERE "follows"."project_id" = ?  [["project_id", 3]]