crowdfund2/app/views/projects/show.html.erb


  <h3><%= pluralize(@project.pledges.size, "Pledge") %> <span style="font-weight: normal;"><%= link_to "See All Pledges", project_pledges_path(@project) %></span></h3>
---
SELECT "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ?  [["project_id", 2]]
SELECT COUNT(*) FROM "pledges"  WHERE "pledges"."project_id" = ?  [["project_id", 6]]

    <ol id="pledges">
      <% @project.pledges.order("created_at DESC").take(3).each do |pledge| %>
---
SELECT  "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ?  ORDER BY created_at DESC LIMIT 3  [["project_id", 3]]