flix2/app/views/users/show.html.erb

    <% if @favorite_movies.any? %>
      <h3><%= pluralize(@favorite_movies.size, "Favorite Movie") %></h3>
---
SELECT "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 16]]
SELECT COUNT(*) FROM "favorites"  WHERE "favorites"."user_id" = ?  [["user_id", 16]]