flix/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-10-30 14:30:21.625976')  ORDER BY released_on desc

  def update
    @movie = Movie.find(params[:id])
    @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = 6  [["description", "An epic battle between The Caped Crusader and the fire-breathing dinosaur Gojira. Hang on to your popcorn, kids! Yowza!"], ["updated_at", "2015-11-11 14:22:36.825001"]]

  def create # need to save this movie into the DB
    @movie = Movie.new(movie_params)
    @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)