flix/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("city", "comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create #saves the contents of the rendered form
      @review = @movie.reviews.new(review_params)
        if @review.save #this implies "true"

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 7], ["id", 13]]
---
    def show
      @review = @movie.reviews.find(params[:id])

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 7], ["id", 10]]
UPDATE "reviews" SET "city" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 11  [["city", "Belcaste"], ["comment", "I like cats, I really do, but this was just aiiiight."], ["updated_at", "2015-11-19 01:28:01.882849"]]
---
    def update
       @review = @movie.reviews.find(params[:id])
       if @review.update(review_params)