flix/app/views/movies/index.html.erb

<h1>Movies</h1>
<h3>Now showing <%= pluralize(@movies.size, "Movie") %> </h3>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-10-30 14:30:21.625976')  ORDER BY released_on desc