flix/app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 3]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 5]]
---

  <h2>Read <%= link_to pluralize(@movie.reviews.size, "Review"), movie_reviews_path(@movie) %></h2>