events2/app/views/events/index.html.erb

SELECT  1 AS one FROM "likes"  WHERE "likes"."event_id" = ? LIMIT 1  [["event_id", 1]]
SELECT "likes".* FROM "likes"  WHERE "likes"."event_id" = ?  [["event_id", 1]]
---
            <%= pluralize(event.spots_left, 'spot') %> left <br>
            <% if event.likes.any? %>