crowdfund2/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"   ORDER BY name
---
  def index
     @categories = Category.all

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-12-09 18:03:44.127393"], ["name", "Testy"], ["updated_at", "2015-12-09 18:03:44.127393"]]
---
  def create
    @category = Category.new(category_params)
    @category.save