crowdfund2/app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."slug" = '2' LIMIT 1
---
  def set_category
    @category = Category.find_by!(slug: params[:id])