crowdfund2/app/controllers/follows_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."slug" = 'everybody-loves-cheese' LIMIT 1
---
  def set_project
    @project = Project.find_by!(slug: params[:project_id])