crowdfund2/app/controllers/follows_controller.rb

  def create
    @project.follows.create!(user: current_user)
---
INSERT INTO "follows" ("created_at", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-07 22:15:29.030989"], ["project_id", 9], ["updated_at", "2015-12-07 22:15:29.030989"], ["user_id", 3]]

  def destroy
    follow = current_user.follows.find(params[:id])
    follow.destroy
---
SELECT  "follows".* FROM "follows"  WHERE "follows"."user_id" = ? AND "follows"."id" = ? LIMIT 1  [["user_id", 3], ["id", 8]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 8]]