crowdfund2/app/controllers/pledges_controller.rb

  def create #saves the new pledge to the db
    @pledge = @project.pledges.new(pledge_params)
    if @pledge.save # this imploes true
---
INSERT INTO "pledges" ("amount", "comment", "created_at", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 50.0], ["comment", "oooh baby yeah"], ["created_at", "2015-12-04 21:24:17.835988"], ["project_id", 6], ["updated_at", "2015-12-04 21:24:17.835988"], ["user_id", 3]]

  def show
    #@project = Project.find(params[:id])
    @pledge = @project.pledges.find(params[:id])
---
SELECT  "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ? AND "pledges"."id" = ? LIMIT 1  [["project_id", 11], ["id", 18]]

  def edit
    @pledge = @project.pledges.find(params[:id])
---
SELECT  "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ? AND "pledges"."id" = ? LIMIT 1  [["project_id", 11], ["id", 18]]

  def update
    @pledge = @project.pledges.find(params[:id])
    if @pledge.update(pledge_params)
---
SELECT  "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ? AND "pledges"."id" = ? LIMIT 1  [["project_id", 11], ["id", 18]]
UPDATE "pledges" SET "comment" = ?, "updated_at" = ? WHERE "pledges"."id" = 18  [["comment", "something a little more useful here"], ["updated_at", "2015-11-18 22:41:22.120571"]]

  def destroy
    @pledge = @project.pledges.find(params[:id])
    @pledge.destroy
---
SELECT  "pledges".* FROM "pledges"  WHERE "pledges"."project_id" = ? AND "pledges"."id" = ? LIMIT 1  [["project_id", 3], ["id", 20]]
DELETE FROM "pledges" WHERE "pledges"."id" = ?  [["id", 17]]