crowdfund2/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "follows".* FROM "follows"  WHERE "follows"."user_id" = ? AND "follows"."project_id" = 9 LIMIT 1  [["user_id", 3]]
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."project_id" = ?  ORDER BY created_at DESC  [["project_id", 3]]
---
  def show
    @project = Project.find(params[:id])
    @pledge = Pledge.new
    @followers = @project.followers
    @categories = @project.categories
    if current_user
      @current_followed_project = current_user.follows.find_by(project_id: @project.id)

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "projects"."id" = 3  [["description", "A description of a project involving bonfires and marshmallows. "], ["name", "Bonfire Project"], ["updated_at", "2015-11-13 23:11:19.393434"]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    if @project.save