crowdfund2/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("created_at", "email", "location", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
     if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "location" = ?, "updated_at" = ? WHERE "users"."id" = 10  [["location", "Kentuck Knob, PA"], ["updated_at", "2015-12-03 21:17:58.607299"]]