crowdfund2/app/controllers/users_controller.rb

    def set_user
      @user = User.find_by!(username: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'lortza' LIMIT 1